[{"nome":"Introdução à Programação","descricao":"Aprenda os fundamentos da programação usando Java.","aulas":[{"titulo":"Variáveis e Tipos de Dados","conteudo":"Nesta aula, você aprenderá o que são variáveis e como utilizá-las em Java. Será abordado o conceito de tipos primitivos como int, double, char e boolean, além da importância de declarar corretamente os tipos para evitar erros de compilação.\n\nTambém discutiremos como realizar conversões entre tipos de dados (casting), tanto de forma implícita quanto explícita. Essa base é essencial para qualquer programa funcional."},{"titulo":"Condicionais","conteudo":"A estrutura condicional permite que o programa tome decisões com base em condições lógicas. Nesta aula, você verá como utilizar o `if`, `else if` e `else` para controlar o fluxo de execução.\n\nAlém disso, será apresentada a estrutura `switch`, que permite avaliar múltiplos caminhos com base no valor de uma variável. Casos práticos serão demonstrados com exemplos interativos."}]},{"nome":"Estruturas de Dados","descricao":"Listas, pilhas, filas e árvores com Java.","aulas":[{"titulo":"Listas Encadeadas","conteudo":"Nesta aula, será explicado como funcionam as listas encadeadas e por que elas são úteis em situações em que é necessário inserir ou remover elementos com frequência.\n\nSerão construídas listas encadeadas simples e duplamente encadeadas em Java, com análise das vantagens e desvantagens em relação às listas estáticas. Você também aprenderá a percorrer e manipular os elementos dessas listas com laços."}]},{"nome":"Banco de Dados","descricao":"Aprenda SQL e como interagir com bancos de dados relacionais.","aulas":[{"titulo":"Introdução ao SQL","conteudo":"SQL (Structured Query Language) é a linguagem padrão para manipulação de dados em bancos relacionais. Nesta aula, abordaremos os principais comandos: `SELECT`, `INSERT`, `UPDATE` e `DELETE`.\n\nVocê verá como criar tabelas, inserir registros, consultar dados com filtros e atualizar informações. Também será abordado como evitar erros comuns e boas práticas de escrita."},{"titulo":"Modelagem de Dados","conteudo":"Antes de criar o banco de dados, é fundamental modelar os dados corretamente. Nesta aula, vamos aprender a identificar entidades, atributos e relacionamentos.\n\nVocê conhecerá o Diagrama Entidade-Relacionamento (DER), o processo de normalização e como transformar modelos conceituais em físicos. Casos reais serão usados para reforçar o aprendizado."}]},{"nome":"Desenvolvimento Web com HTML e CSS","descricao":"Crie páginas web estilizadas com HTML5 e CSS3.","aulas":[{"titulo":"Estrutura HTML","conteudo":"Nesta aula você entenderá a estrutura de uma página HTML. Veremos como utilizar tags semânticas como `\u003cheader\u003e`, `\u003cmain\u003e`, `\u003carticle\u003e` e `\u003cfooter\u003e` para organizar o conteúdo de forma lógica.\n\nVocê também aprenderá a inserir imagens, vídeos, links e formulários, além de compreender a hierarquia dos elementos HTML e como isso afeta a acessibilidade e a estrutura da página."},{"titulo":"Estilização com CSS","conteudo":"CSS permite personalizar a aparência das páginas web. Nesta aula, serão apresentados os seletores, propriedades e valores usados para definir cores, fontes, margens, espaçamentos e muito mais.\n\nTambém será explorado o uso de Flexbox e Grid para criar layouts responsivos. Ao final da aula, você será capaz de transformar uma página simples em um design moderno e atrativo."}]},{"nome":"Programação Orientada a Objetos","descricao":"Domine os pilares da OOP em Java.","aulas":[{"titulo":"Classes e Objetos","conteudo":"O paradigma orientado a objetos é um dos mais utilizados na programação moderna. Nesta aula, você aprenderá a criar classes e instanciar objetos, entendendo como encapsular dados e comportamentos.\n\nSerá abordado o uso de construtores, métodos e atributos, além da importância da reutilização e modularização do código. Exercícios práticos ajudarão a fixar os conceitos."},{"titulo":"Herança e Polimorfismo","conteudo":"A herança permite que uma classe compartilhe atributos e métodos com outras classes. O polimorfismo, por sua vez, possibilita que objetos de diferentes classes sejam tratados de forma uniforme.\n\nEsta aula mostra como aplicar esses conceitos em Java utilizando `extends`, `super` e sobrescrita de métodos. Também veremos exemplos práticos para mostrar como essas técnicas aumentam a flexibilidade do código."}]},{"nome":"Algoritmos e Lógica de Programação","descricao":"Desenvolva o raciocínio lógico para resolver problemas.","aulas":[{"titulo":"Algoritmos de Ordenação","conteudo":"Ordenar dados é uma tarefa comum em programação. Nesta aula, serão estudados algoritmos clássicos como Bubble Sort, Selection Sort e Insertion Sort.\n\nVocê entenderá como cada um funciona passo a passo, suas complexidades (O(n²), O(n log n), etc.) e quando utilizar cada tipo de ordenação. Implementações em Java serão realizadas durante a aula."},{"titulo":"Algoritmos de Busca","conteudo":"Buscar elementos em listas ou arrays é outra tarefa fundamental. Nesta aula, será apresentada a busca linear e a busca binária.\n\nVamos comparar a eficiência de cada uma e implementar versões práticas para diferentes cenários. Você também aprenderá a adaptar esses algoritmos para estruturas mais complexas."}]}]