[{"nome":"admin","senha":"admin","tipo":"admin","cursosMatriculados":[{"nome":"Introdução à Programação","descricao":"Aprenda os fundamentos da programação usando Java.","aulas":[{"titulo":"Variáveis e Tipos de Dados","conteudo":"Explicação sobre variáveis, tipos primitivos e conversões."},{"titulo":"Condicionais","conteudo":"Uso do if, else e switch para controle de fluxo."},{"titulo":"Arvores","conteudo":"arvores são estruturas de dados e nao plantas"}]},{"nome":"Estruturas de Dados","descricao":"Listas, pilhas, filas e árvores com Java.","aulas":[{"titulo":"Listas Encadeadas","conteudo":"Nesta aula, será explicado como funcionam as listas encadeadas e por que elas são úteis em situações em que é necessário inserir ou remover elementos com frequência.\n\nSerão construídas listas encadeadas simples e duplamente encadeadas em Java, com análise das vantagens e desvantagens em relação às listas estáticas. Você também aprenderá a percorrer e manipular os elementos dessas listas com laços."}]},{"nome":"Desenvolvimento Web com HTML e CSS","descricao":"Crie páginas web estilizadas com HTML5 e CSS3.","aulas":[{"titulo":"Estrutura HTML","conteudo":"Nesta aula você entenderá a estrutura de uma página HTML. Veremos como utilizar tags semânticas como `\u003cheader\u003e`, `\u003cmain\u003e`, `\u003carticle\u003e` e `\u003cfooter\u003e` para organizar o conteúdo de forma lógica.\n\nVocê também aprenderá a inserir imagens, vídeos, links e formulários, além de compreender a hierarquia dos elementos HTML e como isso afeta a acessibilidade e a estrutura da página."},{"titulo":"Estilização com CSS","conteudo":"CSS permite personalizar a aparência das páginas web. Nesta aula, serão apresentados os seletores, propriedades e valores usados para definir cores, fontes, margens, espaçamentos e muito mais.\n\nTambém será explorado o uso de Flexbox e Grid para criar layouts responsivos. Ao final da aula, você será capaz de transformar uma página simples em um design moderno e atrativo."}]}]},{"nome":"joao","senha":"senha123","tipo":"aluno","cursosMatriculados":[]},{"nome":"maria","senha":"prof456","tipo":"professor","cursosMatriculados":[]},{"nome":"victor","senha":"1234","tipo":"admin","cursosMatriculados":[]},{"nome":"mae","login":"mae","senha":"mae","tipo":"aluno","cursosMatriculados":[]},{"nome":"pedro","login":"pedro","senha":"pedro","tipo":"aluno","cursosMatriculados":[]},{"nome":"professor","login":"professor","senha":"professor","tipo":"professor","cursosMatriculados":[]},{"nome":"aluno","login":"aluno","senha":"aluno","tipo":"aluno","cursosMatriculados":[]}]